Repository: AleXWitE/microlearning
Catalog: lib/l10n/app_*.arb
Languages: ru

# title
source: Microlearning-LMS
ru: Микрообучение-LMS

source: Back
ru: Назад

source: Or
ru: Или

source: Next
ru: Следующий

# startApp
source: Enter the App!
ru: Войдите или зарегистрируйтесь в приложении!

# loginApp
source: Please, sign in!
ru: Залогиньтесь в приложении!

# registerApp
source: Don`t have account? Sign up!
ru: Нет аккаунта? Зарегистрируйтесь!

# errorFirebase
source: Something wrong with Firebase!
ru: Нет подключения к Firebase!

source: Sign in
ru: Войти

source: Sign up
ru: Зарегистрироваться

source: Add
ru: Добавить

# errorSignOut
source: Error signing out. Try again.
ru: Ошибка выхода. Попробуйте снова.

# errorSignInCredentials
source: The account already exists with a different credential.
ru: Аккаунт уже существует.

# errorSignInErrCredentials
source: Error occurred while accessing credentials. Try again.
ru: Ошибка произошла во время получения данных. Попробуйте снова.

# errorGoogleSignInCredentials
source: Error occurred using Google Sign In. Try again.
ru: Ошибка произошла во время входа через Google. Попробуйте снова.

# infoAfterReg
source: Now you need sign in!
ru: А теперь залогинься!

source: Password
ru: Пароль

# passwordErr
source: Please, enter the password
ru: Пожалуйста, введите пароль

# passwordRepeat
source: Repeat password
ru: Повторите пароль

# passwordRepeatErr
source: Please, repeat your password correctly
ru: Пожалуйста, повторите пароль корректно

# createAcc
source: Create account
ru: Создать аккаунт

# email
source: Your e-mail
ru: Ваш e-mail

# emailErr
source: Please, enter your e-mail
ru: Пожалуйста, введите ваш e-mail

# googleSignInInfo
source: Sign in with Google
ru: Войти с помощью Google

# drawerNav
source: Navigation
ru: Навигация

# drawerHome
source: Home
ru: Список курсов

# drawerToList
source: To list
ru: К списку собыий

# drawerAdd
source: Add event
ru: Добавить событие на сервер

# drawerFavorite
source: Favorites
ru: Избранное

# drawerAbout
source: About app
ru: О приложении

# drawerExit
source: Exit
ru: Выход

source: Hello,
ru: Привет,

# titleDivision
source: in division
ru: в организации

# titleAvailable
source: available
ru: курсов доступно:

# chooseCourse
source: Course
ru: Курс

# favWarning
source: There is no favorite data!
ru: В избранное ничего не добавлено!

# favAlertInfo
source: Do you really want delete all favorites?
ru: Вы действительно хотите удалить все избранные курсы?

# favAlertCancel
source: Cancel
ru: Отмена

# favAlertDel
source: Delete
ru: Удалить

# warningConnection
source: Something wrong! Check your connection
ru: Что-то пошло не так! Проверьте подключение к интернету

# warningConnectionBrowser
source: It`s disabled CORS at server, I can`t fix it :(
ru: Это выключенный CORS на сервере, у меня нет прав администратора чтобы починить это :(

# aboutGithub
source: This project code on
ru: Исходный код приложения на

# aboutVk
source: VK Profile
ru: Профиль Вк

# addDivision
source: Add a division
ru: Добавить организацию

# addModerator
source: Add a moderator to division
ru: Добавить модератора для организации

# addCourse
source: Add a course to division
ru: Добавить курс для организации

# addCourseCard
source: Add a card to course
ru: Добавить карточку курса

# addOneCard
source: Add one card to course
ru: Добавить одну карточку в курс

source: Answer
ru: Ответ

# curAnswer
source: The correct answer
ru: Правильный ответ

# wrongAnswer
source: The answer not entered!
ru: Ответ не введен!

# wrongCurrentAnswer
source: The correct answer must match one of the entered ones!
ru: Правильный ответ должен совпадать с одним из введенных!

# adminForm
source: Remote console
ru: Панель управления

# moderatorForm
source: Remote console
ru: Панель управления

# notAdmin
source: You are not admin!
ru: Вы не администратор!

# notModerator
source: You are not moderator!
ru: Вы не модератор!

source: Division
ru: Организация

source: Moderator
ru: Модератор

source: Course name
ru: Название курса

source: Card name
ru: Название карточки

# adminBlock
source: Add to base
ru: Добавить в базу

# dropdownDivisions
source: Choose the division
ru: Выберите организацию

# dropdownModerator
source: Choose the moderator
ru: Выберите модератора

# emptyModUserInDiv
source: In choose division no one user!
ru: В выбранной организации нет ни одного пользователя!

# emptyCoursesInDiv
source: In choose division no one course!
ru: В выбранной организации нет ни одного курса!

# dropdownCourse
source: Choose the course
ru: Выберите курс

# dropdownType
source: Choose a card type
ru: Выберите тип карточки

# courseError
source: Enter the course name!
ru: Введите название курса!

# divisionError
source: Enter the division name!
ru: Введите название организации!

# cardNameError
source: Enter the card name!
ru: Введите название карточки!

# cardQuestion
source: Question or lecture
ru: Вопрос или теория

# cardQuestionError
source: Enter question or lecture!
ru: Введите текст вопроса или теории!

# cardContentUrl
source: Content url
ru: Ссылка на дополнительный контент

# moderatorError
source: Enter moderator name!
ru: Выберите модератора!

# userFavoritesCourses
source: Favorite courses of
ru: Избранные курсы у пользователя

# aboutApp1
source: This training application, with the principles of microlearning, was developed by a student of the Moscow Polytechnic University in the conditions of the competence Final qualification work The tasks of this application are as follows:
ru: Данное обучающее приложение с учетом принципов микрообучения было разработано студентом Московского политеха в рамках компетенции Выпускная квалификационная работа. Задачи данного приложения следующие:

# aboutApp2
source: - User registration and authorization via email and login via Google account;
ru: - Регистрация и авторизация пользователя через почту и вход через Google аккаунт;

# aboutApp3
source: - differentiation of roles for the user (only viewing courses), the moderator (adding a course for the organization in which it is registered) and the administrator, who can add everything (organizations, courses, moderators and course cards);
ru: - разграничение ролей на пользователя (только просмотр курсов), модератора (добавления курса для организации в которой числится) и администратор, который может добавлять все (организации, курсы, модераторов и карточки курсов);

# aboutApp4
source: - view courses, read theory, watch videos from youtube hosting, answer test parts of courses (radio buttons and checkboxes);
ru: - просмотр курсов, прочтение теории, просмотр видео с хостинга youtube, ответа на тестовые части курсов (радио кнопки и чек боксы);

# aboutApp5
source: - adding courses to favorites;
ru: - добавление курсы в избранное;

# aboutApp6
source: - deleting courses from favorites;
ru: - удаление курсов из избранного;

# aboutApp7
source: - exit the application and then log in.
ru: - выход из приложения с последующей авторизацией.

# youAreAdmin
source: You are admin. Choose the division for continue.
ru: Вы администратор. Выберите организацию чтобы продолжить.
